Revit 2027 API
TableCellStyle.IsEnabled Property
 Gets or sets the status whether this cell is enabled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEnabled { get; set; }
Public Property IsEnabled As Boolean
	Get
	Set
public:
property bool IsEnabled {
	bool get ();
	void set (bool value);
}
member IsEnabled : bool with get, set
Property Value
Boolean
 True if this cell is enabled; otherwise False.
See Also
Reference
TableCellStyle Class
Autodesk.Revit.DB Namespace